hengshan/app/controllers/activities_controller.rb

  def index
    @activity = Activity.all
---
SELECT "activities".* FROM "activities"

  def create
    @activity = Activity.new(params[:activity])
    @activity.save
---
INSERT INTO "activities" ("created_at", "description", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?)